{
  "lang_switcher": "简体中文",
  "nav_home": "Home",
  "nav_about": "About",
  "nav_resources": "Resources",
  "nav_contact_me": "Contact Me",
  "nav_about_footer": "About",
  "hero_title": "boxfoonk's <br/> Homepage",
  "hero_subtitle": "Welcome to boxfoonk's page",
  "about_heading": "About",
  "about_subheading": "introduce",
  "about_p_1": "Boxfoonk first encountered the PC network in mid-2012, sparking a great passion and quickly becoming an enthusiast.",
  "about_p_2": "Conducted various research on the Symbian (Java) (jar) system and learned about software development and underlying architecture in the early days of Android.",
  "about_p_3": "Active on forums like Aiwang, XDA, OnePlus Community, MIUI Community, and GFan. Currently has a certain understanding and research in mobile digital devices, PCs, routers, photography, and networks.",
  "skills_title": "Skills & Abilities",
  "skill_android_title": "Android Ecosystem (99%)",
  "skill_android_desc": "In-depth understanding of the Android system's underlying architecture and App ecosystem. Proficient in system customization, performance optimization, flashing, and various modding practices.",
  "skill_pc_title": "PC Hardware & Networking (80%)",
  "skill_pc_desc": "Expert in PC hardware assembly, performance diagnostics, and troubleshooting. Familiar with router configuration, network environment setup, and optimization.",
  "skill_python_title": "Python (60%)",
  "skill_python_desc": "Skilled in using Python for writing automation scripts, data processing, and web scraping for daily workflows.",
  "skill_cpp_title": "C++ (50%)",
  "skill_cpp_desc": "Possesses basic C++ knowledge, understands memory management and object-oriented programming, capable of simple application development and algorithm implementation.",
  "skill_java_title": "Java (30%)",
  "skill_java_desc": "Understands the basics of the Java language and early mobile development (J2ME), which provided a solid foundation for Android development.",
  "resources_title": "Resource Sharing",
  "resources_subtitle": "Information sharing",
  "ai_tools_title": "AI Tools",
  "ai_tools_desc": "An artificial intelligence assistant based on ChatGPT-4.0.",
  "nas_title": "My Cloud Drive",
  "nas_desc": "File sharing provided via Baidu Cloud.",
  "nas_code": "Access Code: SWYT",
  "github_title": "My Github Profile",
  "github_desc": "Daily development and collection of interesting projects.",
  "contact_title": "Contact Me",
  "contact_subtitle": "Jump to my social media homepages.",
  "about_footer_title": "About",
  "about_footer_subtitle": "About me."
}